INSERT INTO `T_CodeBase` (code, lang, code_nm) VALUES
('2000000', 'ko', '공지'),
('2001001', 'ko', '인연의 궤적'),
('2001002', 'ko', '만사록')
ON DUPLICATE KEY UPDATE code_nm = VALUES(code_nm);

INSERT INTO `T_CodeBase` (code, lang, code_nm) VALUES
('3010000', 'ko', '청하'),
('3020000', 'ko', '개봉'),
('3030000', 'ko', '하서')
ON DUPLICATE KEY UPDATE code_nm = VALUES(code_nm);

INSERT INTO `T_CodeBase` (code, lang, code_nm) VALUES
('3031000', 'ko', '옥문관')
ON DUPLICATE KEY UPDATE code_nm = VALUES(code_nm);

INSERT INTO `T_CodeBase` (code, lang, code_nm) VALUES
('3031001', 'ko', '미진 나루'),
('3031002', 'ko', '금사천'),
('3031003', 'ko', '말미로'),
('3031004', 'ko', '아의소')
ON DUPLICATE KEY UPDATE code_nm = VALUES(code_nm);

INSERT INTO `T_CodeBase` (code, lang, code_nm) VALUES
/* 미진 나루 (3031001) */
('4000001', 'ko', '그대에게 보내는 서신'),
('4000002', 'ko', '되풀이되는 상황'),
('4000003', 'ko', '낙타 방울'),
('4000004', 'ko', '혼을 잇는 바람'),
('4000005', 'ko', '사해의 가르침'),
('4000006', 'ko', '어지러운 동굴'),
/* 금사천 (3031002) */
('4000007', 'ko', '대도를 꿈꾸는 자'),
('4000008', 'ko', '공명하는 금슬'),
('4000009', 'ko', '잊혀진 기억'),
/* 말미로 (3031003) */
('4000010', 'ko', '엽전에 새긴 그리움'),
/* 아의소 (3031004) */
('4000011', 'ko', '사막의 술'),
('4000012', 'ko', '만금의 비서'),
('4000013', 'ko', '음가강'),
('4000014', 'ko', '구슬픈 죽음'),
('4000015', 'ko', '붉은 끈과 붉은 끈'),
('4000016', 'ko', '영혼이여, 돌아오라'),
('5000001', 'ko', '공지1')
ON DUPLICATE KEY UPDATE code_nm = VALUES(code_nm);





delete from `T_naesilBoard`;
INSERT INTO `T_naesilBoard` (type_code, region_code, subRegion_code, title_code, `order`, lang, body, writer_id, notice) VALUES
/* 미진 나루(3031001) */
('2001002', '3030000', '3031001', '4000001', 1, 'ko', '그대에게 보내는 서신 내용', NULL, 0),
('2001002', '3030000', '3031001', '4000002', 2, 'ko', '되풀이되는 상황 내용', NULL, 0),
('2001002', '3030000', '3031001', '4000003', 3, 'ko', '낙타 방울 내용', NULL, 0),
('2001002', '3030000', '3031001', '4000004', 4, 'ko', '혼을 잇는 바람 내용', NULL, 0),
('2001002', '3030000', '3031001', '4000005', 5, 'ko', '사해의 가르침 내용', NULL, 0),
('2001002', '3030000', '3031001', '4000006', 6, 'ko', '어지러운 동굴 내용', NULL, 0),
/* 금사천(3031002) */
('2001002', '3030000', '3031002', '4000007', 1, 'ko', '대도를 꿈꾸는 자 내용', NULL, 0),
('2001002', '3030000', '3031002', '4000008', 2, 'ko', '공명하는 금슬 내용', NULL, 0),
('2001002', '3030000', '3031002', '4000009', 3, 'ko', '잊혀진 기억 내용', NULL, 0),
/* 말미로(3031003) */
('2001002', '3030000', '3031003', '4000010', 1, 'ko', '엽전에 새긴 그리움 내용', NULL, 0),
/* 아의소(3031004) */
('2001002', '3030000', '3031004', '4000011', 1, 'ko', '사막의 술 내용', NULL, 0),
('2001002', '3030000', '3031004', '4000012', 2, 'ko', '만금의 비서 내용', NULL, 0),
('2001002', '3030000', '3031004', '4000013', 3, 'ko', '음가강 내용', NULL, 0),
('2001002', '3030000', '3031004', '4000014', 4, 'ko', '구슬픈 죽음 내용', NULL, 0),
('2001002', '3030000', '3031004', '4000015', 5, 'ko', '붉은 끈과 붉은 끈 내용', NULL, 0),
('2001002', '3030000', '3031004', '4000016', 6, 'ko', '영혼이여, 돌아오라 내용', NULL, 0),
/* 공지 */
('2000000', null, null, '5000001', null, 'ko', '공지 내용', NULL, 1)
ON DUPLICATE KEY UPDATE body = VALUES(body);


INSERT INTO `T_Region` (cd1, cd2, cd3) VALUES
/* 하서-옥문관*/
('3030000', '3031000', '3031001'),
('3030000', '3031000', '3031002'),
('3030000', '3031000', '3031003'),
('3030000', '3031000', '3031004')
ON DUPLICATE KEY UPDATE cd1 = VALUES(cd1), cd2 = VALUES(cd2), cd3 = VALUES(cd3);